app/controllers/api/chapters_controller.rb

    def show
        @chapter = Chapter.includes(:commenters, :votes).find_by(id: params[:id])
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def update
        @chapter = Chapter.find_by(id: params[:id])
        if @chapter.update(chapter_params)
---
SELECT  "chapters".* FROM "chapters" WHERE "chapters"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
UPDATE "chapters" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "chapters"."id" = $4  [["title", "Chapter Two?"], ["body", "plz work"], ["updated_at", "2021-01-21 02:36:20.220375"], ["id", 99]]