app/controllers/api/stories_controller.rb

    def create
        @story = Story.new(story_params)
        @story.user_id = current_user.id
        if @story.save
            # create a chapter, save it, then render it
            @chapter = Chapter.new(title: 'Untitled Part 1', body: '', chapter_number: 1, published: false)
            @chapter.story_id = @story.id
            @chapter.user_id = current_user.id
            @chapter.save
---
INSERT INTO "stories" ("title", "user_id", "description", "complete", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "nonsense"], ["user_id", 19], ["description", "im tired"], ["complete", false], ["created_at", "2020-12-18 01:14:25.323068"], ["updated_at", "2020-12-18 01:14:25.323068"]]
INSERT INTO "chapters" ("title", "user_id", "story_id", "body", "chapter_number", "published", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

    def show
        @story = Story.find_by(id: params[:id])
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]

    def index
        @stories = Story.all.includes(:author, :votes)
---
SELECT  "stories".* FROM "stories" WHERE (1) LIMIT $1  [["LIMIT", 1]]

    def update
        @story = Story.find_by(id: params[:id])
        if @story.update(story_params)
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 128], ["LIMIT", 1]]
UPDATE "stories" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "stories"."id" = $4  [["title", "qwerty can change and save?"], ["description", "asdf jk;l"], ["updated_at", "2021-02-17 21:23:33.377657"], ["id", 128]]

    def destroy
        @story = Story.find_by(id: params[:id])

        if @story.destroy
---
SELECT  "stories".* FROM "stories" WHERE "stories"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "stories" WHERE "stories"."id" = $1  [["id", 7]]