app/controllers/api/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "9iw0IiX7MRoNAzaoFtyqYQ"], ["updated_at", "2020-12-08 22:28:45.839948"], ["id", 8]]
---
    def create
        @user = User.create(user_params)
        if @user.save!