app/views/api/stories/show.json.jbuilder

json.chapters do
    @story.chapters.each do |chapter|
---
SELECT "chapters".* FROM "chapters" WHERE "chapters"."story_id" = $1  [["story_id", 2]]